public/man/man1/uuidparse.1/index.html
<!DOCTYPE html>
<html
    lang="en-us"
    dir="ltr"
>
    <head>
        <meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>Manpages - uuidparse.1 | Technical Notes</title>

      <link rel="stylesheet" href="/css/main.min.a9ecaac9d4f7845fc2de4738f7709cab0bd1c3d19c3466fadd637a6987603257.css" integrity="sha256-qeyqydT3hF/C3kc493CcqwvRw9GcNGb63WN6aYdgMlc=" crossorigin="anonymous">


<link rel="stylesheet" href="/css/syntax.css">
        
        
    </head>
    <body>
        <header class="container header">
            <span class="header__title">Technical Notes</span>
<button id="menuOpenBtn" class="header__menu-open-btn"><i data-lucide="menu"></i></button>

  <nav id="siteNav">
    <ul>
    <li>
      <a href="/">Home</a>
    </li>
    <li>
      <a href="/notes/">Notes</a>
    </li>
    <li>
      <a aria-current="true" class="ancestor" href="/man/">Manpages</a>
    </li>
    <li>
      <a href="/search/">Search</a>
    </li>
    </ul>
    <button id="menuCloseBtn" class="header__menu-close-btn"><i data-lucide="x"></i></button>
  </nav>


        </header>
        <main class="container">
            
    <h1>Manpages - uuidparse.1</h1>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
NAME
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>uuidparse - a utility to parse unique identifiers</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
SYNOPSIS
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p><strong>uuidparse</strong> [options] <em>uuid</em></p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
DESCRIPTION
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p>This command will parse unique identifier inputs from either command
line arguments or standard input. The inputs are white-space separated.</p>
</div>
</div>
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
OUTPUT
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<div id="outline-container-headline-5" class="outline-3">
<h3 id="headline-5">
Variants
</h3>
<div id="outline-text-headline-5" class="outline-text-3">
<table>
<tbody>
<tr>
<td>NCS</td>
<td>Network Computing System identifier. These were the original UUIDs.</td>
</tr>
<tr>
<td>DCE</td>
<td>The Open Software Foundation&#39;s (OSF) Distributed Computing Environment UUIDs.</td>
</tr>
<tr>
<td>Microsoft</td>
<td>Microsoft Windows platform globally unique identifier (GUID).</td>
</tr>
<tr>
<td>other</td>
<td>Unknown variant. Usually invalid input data.</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-headline-6" class="outline-3">
<h3 id="headline-6">
Types
</h3>
<div id="outline-text-headline-6" class="outline-text-3">
<table>
<tbody>
<tr>
<td>nil</td>
<td>Special type for zero in type file.</td>
</tr>
<tr>
<td>time-based</td>
<td>The DCE time based.</td>
</tr>
<tr>
<td>DCE</td>
<td>The DCE time and MAC Address.</td>
</tr>
<tr>
<td>name-based</td>
<td>RFC 4122 md5sum hash.</td>
</tr>
<tr>
<td>random</td>
<td>RFC 4122 random.</td>
</tr>
<tr>
<td>sha1-based</td>
<td>RFC 4122 sha-1 hash.</td>
</tr>
<tr>
<td>unknown</td>
<td>Unknown type. Usually invalid input data.</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-7" class="outline-2">
<h2 id="headline-7">
OPTIONS
</h2>
<div id="outline-text-headline-7" class="outline-text-2">
<p><strong>-J</strong>, <strong>–json</strong></p>
<blockquote>
<p>Use JSON output format.</p>
</blockquote>
<p>
<strong>-n</strong>, <strong>–noheadings</strong></p>
<blockquote>
<p>Do not print a header line.</p>
</blockquote>
<p>
<strong>-o</strong>, <strong>–output</strong></p>
<blockquote>
<p>Specify which output columns to print. Use <strong>–help</strong> to get a list of all
supported columns.</p>
</blockquote>
<p>
<strong>-r</strong>, <strong>–raw</strong></p>
<blockquote>
<p>Use the raw output format.</p>
</blockquote>
<p>
<strong>-h</strong>, <strong>–help</strong></p>
<blockquote>
<p>Display help text and exit.</p>
</blockquote>
<p>
<strong>-V</strong>, <strong>–version</strong></p>
<blockquote>
<p>Print version and exit.</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-8" class="outline-2">
<h2 id="headline-8">
AUTHORS
</h2>
</div>
<div id="outline-container-headline-9" class="outline-2">
<h2 id="headline-9">
SEE ALSO
</h2>
<div id="outline-text-headline-9" class="outline-text-2">
<p>*uuidgen*(1), *libuuid*(3), <em>RFC 4122</em>
&lt;<a href="https://tools.ietf.org/html/rfc4122">https://tools.ietf.org/html/rfc4122</a>&gt;</p>
</div>
</div>
<div id="outline-container-headline-10" class="outline-2">
<h2 id="headline-10">
REPORTING BUGS
</h2>
<div id="outline-text-headline-10" class="outline-text-2">
<p>For bug reports, use the issue tracker at
&lt;<a href="https://github.com/util-linux/util-linux/issues">https://github.com/util-linux/util-linux/issues</a>&gt;.</p>
</div>
</div>
<div id="outline-container-headline-11" class="outline-2">
<h2 id="headline-11">
AVAILABILITY
</h2>
<div id="outline-text-headline-11" class="outline-text-2">
<p>The <strong>uuidparse</strong> command is part of the util-linux package which can be
downloaded from <em>Linux Kernel Archive</em>
&lt;<a href="https://www.kernel.org/pub/linux/utils/util-linux/">https://www.kernel.org/pub/linux/utils/util-linux/</a>&gt;.</p>
</div>
</div>


        </main>
        <footer class="container footer">
            <p>Copyright 2024. All rights reserved.</p>

        </footer>

        
        

        
            <script src="/js/main.95916b5b8c09add4922ea47e674b5da7fc4b6347a3e8c4e25e98b4b7d236080b.js" integrity="sha256-lZFrW4wJrdSSLqR&#43;Z0tdp/xLY0ej6MTiXpi0t9I2CAs=" crossorigin="anonymous"></script>
    </body>
</html>
